// ==========================================
// 🎒 小クイズデータ追加
// ==========================================
// 💡 親から配列を関数として受け取る
export function loadQuestions_add(targetArray) {

// 追加クイズ
targetArray.push(...[
{ grade: 4, genre: "etc", type: "select", text: "ネットやスマホでの、<b>きけん</b>なこととして ただしくないものはどれ？", choices: ["歩きながら使う", "ネット情報をすぐ信じる", "夜おそくまで使う", "いすにすわって使う"], answer: "いすにすわって使う", explanation: "せいかいは「いすにすわって使う」。<br>歩きスマホは事故につながるし、ネット情報をすぐ信じるとだまされることがあるよ。夜おそくまで使うと体調をくずすこともあるから、<b>きけん</b>だよ。" },
{ grade: 4, genre: "etc", type: "select", text: "「夜おそくまでスマホを使う」と、どんな<b>きけん</b>があるかな？", choices: ["ねむれなくなる", "おなかがすく", "人とぶつかる", "手がつかれる"], answer: "ねむれなくなる", explanation: "せいかいは「ねむれなくなる」。<br>夜おそくまでスマホを使うと、ねむれなくなって生活のリズムがくずれるよ。目がつかれることや、使いすぎになることもあるんだ。" },
{ grade: 4, genre: "etc", type: "select", text: "「イライラした気もちでスマホを使う」と、どんな<b>きけん</b>があるかな？", choices: ["相手をきずつけてしまう", "ねむれなくなる", "スマホが熱くなってやけどする", "先生におこられる"], answer: "相手をきずつけてしまう", explanation: "せいかいは「相手をきずつけてしまう」。<br>イライラしたままスマホを使うと、強い言葉を送ってしまったり、トラブルになったり、相手をきずつけてしまうことがあるよ。" },
{ grade: 4, genre: "etc", type: "select", text: "スマホで「ふざけた写真」をとると、どんな<b>きけん</b>があるかな？", choices: ["見た人をいやな気もちにする", "スマホから火が出る", "人とぶつかる", "カメラがこわれる"], answer: "見た人をいやな気もちにする", explanation: "せいかいは「見た人をいやな気もちにする」。<br>ふざけた写真は、だれかをいやな気もちにさせたり、ネットに広がってトラブルになることがあるよ。" },
{ grade: 4, genre: "etc", type: "select", text: "「ネットの情報をすぐに信じる」と、どんな<b>きけん</b>があるかな？", choices: ["まちがったことをしてトラブルになる", "スマホから火が出る", "ねむれなくなる", "カメラがこわれる"], answer: "まちがったことをしてトラブルになる", explanation: "せいかいは「まちがったことをしてトラブルになる」。<br>ネットの情報にはまちがったものもあるよ。すぐに信じると、だまされたり、まちがった行動をしてトラブルになることがあるんだ。" },
{ grade: 4, genre: "etc", type: "select", text: "「スマホを歩きながら使う」と、どんな<b>きけん</b>があるかな？", choices: ["人とぶつかる", "スマホから火が出る", "見た人をいやな気もちにする", "カメラがこわれる"], answer: "人とぶつかる", explanation: "せいかいは「人とぶつかる」。<br>歩きスマホは前が見えなくなるので、人とぶつかったり、転んだりしてけがをすることがあるよ。" },

]);

}
