// ==========================================
// 🎒 小クイズデータ追加
// ==========================================
// 💡 親から配列を関数として受け取る
export function loadQuestions_add(targetArray) {

// 🟥 【こくご：japanese】
targetArray.push(...[
]);
// 🟥 【さんすう：Math】
targetArray.push(...[
  { grade: 4, genre: "math", type: "which", text: "「四捨五入」とは、5 以上なら<b>切り上げ</b>、4 以下なら<b>切り捨てる</b>きまりである。", choices: [true, false], answer: true, explanation: "「四捨五入（ししゃごにゅう）」とは、ある位を見て、<b>数をだいたいの大きさにする</b>ためのきまり のことです。<br>たとえば「十の位で四捨五入する」と言われたら、一の位の数字 を見ます。<br>・一の位が 0〜4 のとき → 切りすてる（小さくする）<br>・一の位が 5〜9 のとき → 切り上げる（大きくする）<br>というルールです。" },
  { grade: 4, genre: "math", type: "which", text: "「概算」とは、正確な数ではなく、<b>だいたいの大きさを表す数</b>である。", choices: [true, false], answer: true, explanation: "「概数」とは、正確な数ではなく、<b>「だいたいこのくらい」を表す数</b> のことです。<br>大きい数や細かい数を、<b>使いやすく</b>・<b>わかりやすく</b>・<b>目的に合わせて</b>、数の大きさをつかみやすくします。" },
]);

}
