// ==========================================
// 🎒 小クイズデータ追加
// ==========================================
// 💡 親から配列を関数として受け取る
export function loadQuestions_add(targetArray) {

// 🟥 【こくご：japanese】
targetArray.push(...[
]);
// 🟥 【さんすう：Math】
targetArray.push(...[
    // わり算のひっ算
    { grade: 4, genre: "math", type: "select", text: "わり算の筆算で「立てる」とはどんな意味かな？", choices: ["割る数がいくつ入るか考える","引き算をする","次の位の数字を下におろす","商と割る数をかける"], answer: "割る数がいくつ入るか考える", explanation: "せいかいは「割る数がいくつ入るか考える」。<br>「立てる」は、割る数が 何回入るかを考えて 商を書くことだよ。" },
    { grade: 4, genre: "math", type: "select", text: "わり算の筆算で「かける」とはどんな意味かな？", choices: ["割る数がいくつ入るか考える","引き算をする","次の位の数字を下におろす","商と割る数をかける"], answer: "商と割る数をかける", explanation: "せいかいは「商と割る数をかける」。<br>「かける」は、立てた商と 割る数をかけ算して 下に書くことだよ。" },
    { grade: 4, genre: "math", type: "select", text: "わり算の筆算で「引く」とはどんな意味かな？", choices: ["割る数がいくつ入るか考える","引き算をする","次の位の数字を下におろす","商と割る数をかける"], answer: "引き算をする", explanation: "せいかいは「引き算をする」。<br>「引く」は、割られる数から、かけ算した答えを 引き算することだよ。" },    
    { grade: 4, genre: "math", type: "select", text: "わり算の筆算で「おろす」とはどんな意味かな？", choices: ["割る数がいくつ入るか考える","引き算をする","次の位の数字を下におろす","商と割る数をかける"], answer: "次の位の数字を下におろす", explanation: "せいかいは「次の位の数字を下におろす」。<br>「おろす」は、引き算した 残りの右に 次の位の数字を下ろすことだよ。" }
]);

}
